src/21math530/KBrefOrthogonal.org
#+TITLE: Orthogonal
#+context: linear algebra
* orthogonal                                                           :def:
  #+begin_quote
  Two vectors $u, v \in V$ are called /orthogonal/ if $\langle u, v \rangle = 0$
  #+end_quote
* results
** orthogonal ~= perpendicular
** Axler 6.12 orthogonality and zero
*** 0 is orthogonal to every vector in $V$
*** 0 is the only vector in $V$ that is orthogonal to itself
** Axler 6.13 Pythagorean Theorem
   #+begin_quote
   Suppose $u$ and $v$ are orthogonal vectors in $V$. Then
   \[\begin{aligned}
   \lVert u+v \rVert^2 = \lVert u \rVert^2 + \lVert v \rVert^2
   \end{aligned}\]
   #+end_quote
*** proof with more algebra written out

	\[\begin{aligned}
	\lVert u+v \rVert^2 &= \langle u+v, u+v \rangle\\
	&= \langle u, u+v \rangle + \langle v, u+v \rangle\\
	&= \langle u,u \rangle + \cancelto{0}{\langle u, v \rangle} + \cancelto{0}{\langle v, u \rangle} + \langle v,v \rangle\\
	&= \lVert u \rVert^2 + \lVert v \rVert^2
	\end{aligned}\]
