docs/math530/KBrefOrthogonal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 09:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orthogonal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Orthogonal</h1>
<div id="outline-container-orgf6258bf" class="outline-2">
<h2 id="orgf6258bf"><span class="section-number-2">1</span> orthogonal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Two vectors \(u, v \in V\) are called <i>orthogonal</i> if \(\langle u, v \rangle = 0\)
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgeebd2e2" class="outline-2">
<h2 id="orgeebd2e2"><span class="section-number-2">2</span> results</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc6bb89a" class="outline-3">
<h3 id="orgc6bb89a"><span class="section-number-3">2.1</span> orthogonal ~= perpendicular</h3>
</div>
<div id="outline-container-org37e4d25" class="outline-3">
<h3 id="org37e4d25"><span class="section-number-3">2.2</span> Axler 6.12 orthogonality and zero</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgb76d3b6" class="outline-4">
<h4 id="orgb76d3b6"><span class="section-number-4">2.2.1</span> 0 is orthogonal to every vector in \(V\)</h4>
</div>
<div id="outline-container-org09e4e25" class="outline-4">
<h4 id="org09e4e25"><span class="section-number-4">2.2.2</span> 0 is the only vector in \(V\) that is orthogonal to itself</h4>
</div>
</div>
<div id="outline-container-org10a4a65" class="outline-3">
<h3 id="org10a4a65"><span class="section-number-3">2.3</span> Axler 6.13 Pythagorean Theorem</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
Suppose \(u\) and \(v\) are orthogonal vectors in \(V\). Then
\[\begin{aligned}
   \lVert u+v \rVert^2 = \lVert u \rVert^2 + \lVert v \rVert^2
   \end{aligned}\]
</p>
</blockquote>
</div>
<div id="outline-container-org4cf6c3c" class="outline-4">
<h4 id="org4cf6c3c"><span class="section-number-4">2.3.1</span> proof with more algebra written out</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
\[\begin{aligned}
	\lVert u+v \rVert^2 &= \langle u+v, u+v \rangle\\
	&= \langle u, u+v \rangle + \langle v, u+v \rangle\\
	&= \langle u,u \rangle + \cancelto{0}{\langle u, v \rangle} + \cancelto{0}{\langle v, u \rangle} + \langle v,v \rangle\\
	&= \lVert u \rVert^2 + \lVert v \rVert^2
	\end{aligned}\]
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Taproot</span><span class="date">2021-09-11 Sat 09:29</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
